**FREE
// ===================================================================================================================================
    CTL-OPT DFTACTGRP(*NO) ACTGRP('TIMETRACK') BNDDIR('TSBNDDIR') DEBUG(*YES) OPTION(*NODEBUGIO);
// ===================================================================================================================================
// Program ID       :   TS0305
// Description      :   Subset for Summary (View)
// Author           :   Vinayak Mahajan
// Date written     :   September 27, 2016
// Based On Pgm     :   None
// Reviewer         :
// Date Reviewed    :
// ===================================================================================================================================
// Modification History
// -----------------------------------------------------------------------------------------------------------------------------------
// ===================================================================================================================================
// Files
// -----------------------------------------------------------------------------------------------------------------------------------
    DCL-F   TS0303DS    WORKSTN INFDS(DSPFINFDS) SFILE(TS03031:RRN1);
// ===================================================================================================================================
// Arrays
// -----------------------------------------------------------------------------------------------------------------------------------
// ===================================================================================================================================
// Internal Data Structures
// -----------------------------------------------------------------------------------------------------------------------------------
    DCL-DS  FromSUM     BASED(pFromSUM) QUALIFIED;
            EntryDate   ZONED(8:0);
            ActID       ZONED(5:0);
            DrtnHH      ZONED(2:0);
            DrtnMM      ZONED(2:0);
    END-DS;

    DCL-DS  ToSUM       BASED(pToSUM)   QUALIFIED;
            EntryDate   ZONED(8:0);
            ActID       ZONED(5:0);
            DrtnHH      ZONED(2:0);
            DrtnMM      ZONED(2:0);
    END-DS;
// ===================================================================================================================================
// External Data Structures
// -----------------------------------------------------------------------------------------------------------------------------------
    DCL-DS  DSPFINFDS   EXTNAME('DSPFIDS');
    END-DS;
// ===================================================================================================================================
// System Data Structures
// -----------------------------------------------------------------------------------------------------------------------------------
// ===================================================================================================================================
// Internal Standalone Fields
// -----------------------------------------------------------------------------------------------------------------------------------
// ===================================================================================================================================
// Constants
// -----------------------------------------------------------------------------------------------------------------------------------
// ===================================================================================================================================
// Switches
// -----------------------------------------------------------------------------------------------------------------------------------
// ===================================================================================================================================
// Prototypes
// -----------------------------------------------------------------------------------------------------------------------------------
    /COPY /QOpenSys/QIBM/UserData/OPS/Orion/serverworkspace/vi/vinayakmahajan/OrionContent/TSP/TS9902PR.sqlrpgle
// ===================================================================================================================================
// Parameters for Various Programs 
// -----------------------------------------------------------------------------------------------------------------------------------

// Parameters for this Program

    DCL-PR      TS0305;
    DCL-PARM    pFromSUM    POINTER;
    DCL-PARM    pToSUM      POINTER;
    DCL-PARM    F12Pressed  CHAR(1);
    DCL-PARM    Message     CHAR(78);
    DCL-PARM    ErrorID     ZONED(5:0);
    END-PR;
// ===================================================================================================================================
// Program Entry Parameters
// -----------------------------------------------------------------------------------------------------------------------------------
    DCL-PI      TS0305;
    DCL-PARM    pFromSUM    POINTER;
    DCL-PARM    pToSUM      POINTER;
    DCL-PARM    F12Pressed  CHAR(1);
    DCL-PARM    Message     CHAR(78);
    DCL-PARM    ErrorID     ZONED(5:0);
    END-PI;
// ===================================================================================================================================
//
// -----------------------------------------------------------------------------------------------------------------------------------

    EXSR    InitScr01;
    EXSR    DispScr01;
    EXSR    AcptScr01;
    EXSR    SetRtrnParms;

    RETURN;

// ===================================================================================================================================
// Initialize Screen 01
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   InitScr01;

        EXSR    ResetScr01Ind;
        EXSR    SetScr01Flds;
        EXSR    SetScr01Cursor;

    ENDSR;
// ===================================================================================================================================
// Reset Screen 01 Indicators
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   ResetScr01Ind;

        *In50   =   *Off;

        *In51   =   *Off;
        *In52   =   *Off;
        *In53   =   *Off;

    ENDSR;
// ===================================================================================================================================
// Set Screen 01 Field Values
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   SetScr01Flds;

        FROMDATE    =   FromSUM.EntryDate;
        FROMACTID   =   FromSUM.ActID;
        FROMDRTNH   =   FromSUM.DrtnHH;
        FROMDRTNM   =   FromSUM.DrtnMM;

        TODATE      =   ToSUM.EntryDate;
        TOACTID     =   ToSUM.ActID;
        TODRTNH     =   ToSUM.DrtnHH;
        TODRTNM     =   ToSUM.DrtnMM;

        MESSAGE     =   Message;
        
    ENDSR;
// ===================================================================================================================================
// Set Screen 01 Field Cursor
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   SetScr01Cursor;

        SELECT;
            WHEN    ErrorID =   29;         //From Date > To Date.
                    *In51   =   *On;

            WHEN    ErrorID =   30;         //From Activity ID > To Activity ID.
                    *In52   =   *On;

            WHEN    ErrorID =   33;         //From Duration > To Duration.
                    *In53   =   *On;
        ENDSL;

    ENDSR;
// ===================================================================================================================================
// Display Screen 01
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   DispScr01;

        IF  Message <>  *Blanks;
            *In50   =   *On;
        ENDIF;

        WRITE   TS03032;

    ENDSR;
// ===================================================================================================================================
// Accept Screen 01
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   AcptScr01;

        READ    TS03032;

    ENDSR;
// ===================================================================================================================================
// Set Return Parameters
// -----------------------------------------------------------------------------------------------------------------------------------
    BEGSR   SetRtrnParms;

        IF  *In12               =   *On;
            F12Pressed          =   'Y';
        ELSE;
            // Move Screen Fields to Database Fields
            FromSUM.EntryDate   =   FROMDATE;
            FromSUM.ActID       =   FROMACTID;
            FromSUM.DrtnHH      =   FROMDRTNH;
            FromSUM.DrtnMM      =   FROMDRTNM;
        
            ToSUM.EntryDate     =   TODATE;
            ToSUM.ActID         =   TOACTID;
            ToSUM.DrtnHH        =   TODRTNH;
            ToSUM.DrtnMM        =   TODRTNM;
        ENDIF;

        IF  ToSUM.EntryDate =   *Zeros;
            ToSUM.EntryDate =   99999999;
        ENDIF;

        IF  ToSUM.ActID     =   *Zeros;
            ToSUM.ActID     =   99999;
        ENDIF;

        IF  ToSUM.DrtnHH    =   *Zeros;
            ToSUM.DrtnHH    =   99;
        ENDIF;

        IF  ToSUM.DrtnMM    =   *Zeros;
            ToSUM.DrtnMM    =   99;
        ENDIF;

    ENDSR;
// ===================================================================================================================================